/// ### 书写板组件
///
/// "汪涛的记事本"的所有书写组件就是基于它开发的，易用但强大
///
/// #### 简介
///
/// 前情提要下,
/// 在主线“汪涛的记事本”中,
/// 我可是详细提了下我期望的记事本的形状,
/// 它应该是传统手写与现代富文本结合的记事本,
/// 在我书写时提供便捷的功能让我沉浸手写并且能在我写完复盘时对我书写后的内容进行编辑
/// (强调一下,就像编辑富文本一样便捷哦)
///
/// 苹果的备忘录就是个好例子,
/// 沉浸书写的时候感觉就像在一张纸上写字,
/// 编辑也很方便
/// 虽然没达到我心目中的要求,
/// 我最期望的是记事本编辑手写文字就跟编辑 Word 那样长按框选,
/// 还能全选某一段那样的
///
/// #### 使用方法
///
/// {@macro Writingboard.使用}
///
/// #### 目前实现功能
library notepad_forwangtao_writingboard;

export './widget/writingboard.dart';
export './widget/boardcontroller.dart';
